class QualificationAllowance < ActiveRecord::Base
	belongs_to :user

  def self.item_choices
    [["ITストラテジスト","ITストラテジスト"],
     ["システム監査技術者","システム監査技術者"],
     ["システムアーキテクト","システムアーキテクト"],
     ["応用情報技術者","応用情報技術者"],
     ["プロジェクトマネージャー","プロジェクトマネージャー"],
     ["ネットワーク・スペシャリスト","ネットワーク・スペシャリスト"],
     ["データベーススペシャリスト","データベーススペシャリスト"],
     ["エンベンデッドシステムスペシャリスト","エンベンデッドシステムスペシャリスト"],
     ["情報セキュリティースペシャリスト","情報セキュリティースペシャリスト"],
     ["ITサービスマネーシャー","ITサービスマネーシャー"],
     ["基本情報技術者","基本情報技術者"],
     ["ITパスポート","ITパスポート"]]
  end

  def self.number_choices
    [["A1","A1"],
     ["A2","A2"],
     ["A3","A3"],
     ["A4","A4"],
     ["A5","A5"],
     ["A6","A6"],
     ["A7","A7"],
     ["A8","A8"],
     ["A9","A9"],
     ["A10","A10"],
     ["A11","A11"],
     ["A12","A12"]]
  end

  def self.money_choices
    [["A1~A3 : 30000","30000"],
     ["A4~A10 : 20000","20000"],
     ["A11 : 10000","10000"],
     ["A12 : 3000","3000"]]
  end
end
